Catalogs/ИнформационныеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ИнформационныеКарты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адресс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДисконтнойКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДисконтныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИнформационныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПользователей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Comment>Дата выдачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Comment>Дата изъятия</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Comment>Дата регистрации в системе</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГендернаяПринадлежность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнееПоздравление</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентУточняемый</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресторан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнформационныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЧленыСемьи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРождения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрационныеКарты</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:CatalogRef.Сертификаты</v8:Type>
						<v8:Type>cfg:DocumentRef.НакладнаяНаДоставку</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыИнформационныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ТипыИнформационныхКарт</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дисконтная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Регистрационная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыИнформационныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ВидыИнформационныхКарт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Магнитная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Штриховая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ИнформационныеКарты/Ext/ObjectModule.bsl
Функция ПолучитьНаименование()

	Если (ТипКарты = Перечисления.ТипыИнформационныхКарт.Регистрационная) Тогда
		Возврат НСтр("ru = 'Регистрационная № '; uk = 'Реєстраційна № '") + КодКарты;
	КонецЕсли; 
	Если (ТипКарты = Перечисления.ТипыИнформационныхКарт.Дисконтная) Тогда
		Если ЗначениеЗаполнено(ВидДисконтнойКарты) И (Не ПустаяСтрока(КодКарты)) Тогда
			Возврат Шаблон("[ВидДисконтнойКарты] № [КодКарты]", 
				Новый Структура("ВидДисконтнойКарты,КодКарты", ВидДисконтнойКарты, КодКарты));
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат "№" + КодКарты; 
		
КонецФункции // ПолучитьНаименование()


Процедура ОбработкаЗаполнения(Основание)
	
	// Контрагенты.
	Если ТипЗнч(Основание) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		ТипКарты = Перечисления.ТипыИнформационныхКарт.Дисконтная;
		Если Основание.ЭтоГруппа Тогда
			ВладелецКарты = Справочники.Контрагенты.ПустаяСсылка();
		Иначе
			ВладелецКарты = Основание.Ссылка;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ОбработкаЗаполнения()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Проверка.
	Если Не ЭтоГруппа Тогда
		
		Если ПустаяСтрока(Наименование) Тогда
			Наименование = ПолучитьНаименование();
		КонецЕсли; 
		
		Если Не __УправлениеДаннымиСервер.ПроверитьУникальностьРеквизитаСправочника(ЭтотОбъект, "КодКарты") Тогда
			__ОбщегоНазначенияСервер.СообщитьОбНеуникальностиРеквизитаСправочника(ЭтотОбъект, "КодКарты", , Отказ);
		КонецЕсли; 
		
		Если (ТипКарты = Перечисления.ТипыИнформационныхКарт.Регистрационная) Тогда
			
			__ОбщегоНазначенияСервер.ИзменитьПроверяемыеРеквизиты(ПроверяемыеРеквизиты, , "ВидДисконтнойКарты");
			Если (ВидКарты = Перечисления.ВидыИнформационныхКарт.Штриховая) Тогда
				__ОбщегоНазначенияСервер.ИзменитьПроверяемыеРеквизиты(ПроверяемыеРеквизиты, "ТипШтрихкода");
			КонецЕсли; 
			Если ЗначениеЗаполнено(ВладелецКарты) Тогда
				__ОбщегоНазначенияСервер.ИзменитьПроверяемыеРеквизиты(ПроверяемыеРеквизиты, "ГруппаПользователей");
			КонецЕсли; 
			
		Иначе
			
			__ОбщегоНазначенияСервер.ИзменитьПроверяемыеРеквизиты(ПроверяемыеРеквизиты, , "ГруппаПользователей,ТипШтрихкода");
			
			__ОбщегоНазначенияСервер.ИзменитьПроверяемыеРеквизиты(ПроверяемыеРеквизиты, "ВладелецКарты,Пол,ДатаРождения,Телефон,Адресс,EMail,Ресторан"); //Костенюк Александр 18.03.2015
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	
	Если Не ЭтоГруппа Тогда
		КодКарты = Неопределено;
		ПоследнееПоздравление = Неопределено;
		ДатаНачалаПериода = Неопределено;
		ДатаОкончанияПериода = Неопределено;
		
		//Костенюк Александр-Старт 18.10.2012
		ОчиститьКонтактнуюИнформацию();
		//Костенюк Александр-Финиш 18.10.2012
		
		Если ПустаяСтрока(Наименование) Тогда
			Наименование = ПолучитьНаименование();
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры // ПриКопировании()

Процедура ПередЗаписью(Отказ)
	    
	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Если Не ЭтоГруппа Тогда
		
		// Наименование.
		Если ПустаяСтрока(Наименование) Тогда
			Наименование = ПолучитьНаименование();
		КонецЕсли; 
		
		// Зависимые.
		Если (ТипКарты = Перечисления.ТипыИнформационныхКарт.Дисконтная) Тогда
			ГруппаПользователей = Неопределено;
		КонецЕсли; 
		Если (ТипКарты = Перечисления.ТипыИнформационныхКарт.Регистрационная) Тогда
			ВидДисконтнойКарты = Неопределено;
			ПроцентУточняемый = Неопределено;
			ДатаРождения = Неопределено;
			ПоследнееПоздравление = Неопределено;
			Комментарий = Неопределено;
			Если ПометкаУдаления Тогда
				ВладелецКарты = Справочники.Пользователи.ПустаяСсылка();
				ГруппаПользователей = Неопределено;
			КонецЕсли; 
		КонецЕсли; 
		
		ДатаРегистрации = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустуюДату(ДатаРегистрации); //Костенюк Александр 17.02.2015
		
		//// Период.
		//ДатаНачалаПериода = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустуюДату(ДатаНачалаПериода);
		
		//Костенюк Александр-Старт 17.02.2015
		Если ПроверитьЗаполнение() Тогда
			ДатаНачалаПериода = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустуюДату(ДатаНачалаПериода);
		КонецЕсли;
		//Костенюк Александр-Финиш 17.02.2015
		
		Если ПометкаУдаления Тогда
			ДатаОкончанияПериода = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустуюДату(ДатаОкончанияПериода);
		Иначе
			ДатаОкончанияПериода = Неопределено;
		КонецЕсли; 
	
	КонецЕсли; 
		
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ)
	    
	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	// Штрих-код.
	Если (ВидКарты = Перечисления.ВидыИнформационныхКарт.Штриховая) Тогда
		РегистрыСведений.Штрихкоды.УстановитьШтрихКод(ЭтотОбъект, ТипШтрихкода, КодКарты, Отказ);
	Иначе
		РегистрыСведений.Штрихкоды.УстановитьШтрихКод(ЭтотОбъект, Неопределено, Неопределено, Отказ);
	КонецЕсли;
		
	//Костенюк Александр-Старт 21.05.2013
	// Регистрационные карты связываем с регистром
	Если ТипКарты = Перечисления.ТипыИнформационныхКарт.Регистрационная Тогда
		Если ПометкаУдаления Тогда
			РегистрыСведений.РегистрационныеКарты.УдалитьЗапись(Отказ, Ссылка);
		Иначе
			РегистрыСведений.РегистрационныеКарты.ДобавитьЗапись(Отказ, Ссылка);
		КонецЕсли;
	КонецЕсли;
	//Костенюк Александр-Финиш 21.05.2013
	
КонецПроцедуры // ПриЗаписи()

//Костенюк Александр-Старт 18.10.2012
// Процедура заполняет реквизиты, относящиеся к контактной информации
//
// Параметры:
// ВладелецКарты - Тип: СправочникСсылка.Контрагенты. Владелец карты
//
Процедура ЗаполнитьКонтактнуюИнформацию(ВладелецКарты) Экспорт
	
	ТабКонтактнаяИнформация = УправлениеКонтактнойИнформацией.ПрочитатьНаборЗаписейКонтактнойИнформации(ВладелецКарты);
	
	ТелефонКонтрагента 					= Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
	АдресЭлектроннойПочтыКонтрагента 	= Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагента;
	ФакттическийАдресКонтрагента 		= Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
	
	Для Каждого СтрокаТаблицы Из ТабКонтактнаяИнформация Цикл
		
		Если СтрокаТаблицы.Вид = ТелефонКонтрагента Тогда
			Телефон = СтрокаТаблицы.Представление;
		ИначеЕсли СтрокаТаблицы.Вид = АдресЭлектроннойПочтыКонтрагента Тогда
			EMail = СтрокаТаблицы.Представление;
		ИначеЕсли СтрокаТаблицы.Вид = ФакттическийАдресКонтрагента Тогда
			Адресс = СтрокаТаблицы.Представление;
		Иначе
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
//Костенюк Александр-Финиш 18.10.2012

//Костенюк Александр-Старт 18.10.2012
// Процедура очищает реквизиты, относящиеся к контактной информации
//
// Параметры:
// Нет.
//
Процедура ОчиститьКонтактнуюИнформацию() Экспорт
	
	Телефон = "";
	Адресс 	= "";
	EMail 	= "";
	
КонецПроцедуры
//Костенюк Александр-Финиш 18.10.2012



// Рефакторинг:
//	1. Удалить "ДатаРегистрации";
//	2. Контактная информация.
